#!/usr/bin/python
# -*- coding: UTF-8 -*-

print("hello world")

print (u"安安")

print(u"簡述：企業發放的獎金根據利潤提成。利潤(I)低於或等於10萬元時，獎金可提10%；利潤高於10萬元，低於20萬元時，低於10萬元的部分按10%提成，高於10萬元的部分，可提成7.5%；20萬到40萬之間時，高於20萬元的部分，可提成5%；40萬到60萬之間時高於40萬元的部分，可提成3% ；60萬到100萬之間時，高於60萬元的部分，可提成1.5%，高於100萬元時，超過100萬元的部分按1%提成")
print(u"提問：從鍵盤輸入當月利潤I，求應發放獎金總數？")


c = (raw_input(u"請輸入利潤?".encode('gbk')))
a = int(c)

if a <= 100000:
    b = a*0.1
    print(b)
elif a > 100000 and a <= 200000:
    b = ((a-100000)*0.075)+100000*0.1
    print(b)
elif a > 200000 and a <= 400000:
    b = (a-200000)*0.05+100000*0.075+100000*0.1
    print(b)
elif a > 400000 and a <= 600000:
    b = (a-400000)*0.03 + 200000*0.05 + 100000*0.075 + 100000*0.1
    print(b)
elif 1000000 >= a > 600000:
    b = (a-600000)*0.015+200000*0.03+200000*0.05+100000*0.075+100000*0.1
    print(b)
else:
    b = (a-1000000)*0.01+400000*0.015+200000 * \
        0.03+200000*0.05+100000*0.075+100000*0.1
    print(b)
